# Criação Banco de Dados Pycoders

In [1]:
import pandas as pd
import psycopg2
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT
#Create an in-memory SQLite database.
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html
# sqlalchemy será usado para o envio de DataFlames diretamente para o banco.
from sqlalchemy import create_engine
from sqlalchemy import types

In [10]:
#cria uma classe para facilitar a manipulação do banco de dados no python
class MyServer:
    def __init__(self,banco=''):
        self.banco = banco

    #Cria uma conexão com o banco de dados
    def __conectDB(self,banco):
        con = psycopg2.connect(host='amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com', database=banco, user='postgres', password='postgres')
        #con = psycopg2.connect(host='localhost', database=banco, user='postgres', password='123')
        return con
    #Cria um Database no banco
    def create_db(self,banco):
        sql = "CREATE DATABASE  {};".format(banco)
        con = self.__conectDB(self.banco)
        con.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT);
        cur = con.cursor()
        try:
            cur.execute(sql)
            self.banco = banco
            print('Processo Executado com sucesso')
        except Exception as erro:
            print(erro)
        finally:
            con.commit()
            cur.close()
            con.close()

    #Executa uma quary no banco   
    def run_query(self,sql):
        con = self.__conectDB(self.banco)
        con.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT);
        cur = con.cursor()
        try:
            cur.execute(sql)
            print('Processo Executado com sucesso')
        except Exception as erro:
            print(erro)
        finally:
            con.commit()
            cur.close()
            con.close()
    #retorna um recordset de um select no banco     
    def selectSQL(self,sql):
        con = self.__conectDB(self.banco)
        cur = con.cursor()
        try:
            cur.execute(sql)
            recortset = cur.fetchall()
            return recortset
        except Exception as erro:
            print(erro)

        finally:
            con.commit()
            cur.close()
            con.close()

In [11]:
aws_postgres = MyServer() #instaciando o objeto do tipo MyServer
aws_postgres.create_db('dbpy')

Processo Executado com sucesso

In [12]:
df_fabricante = pd.read_csv('fabricante.csv',',') #Importando o arquivo CSV
df_fabricante

    Unnamed: 0  manufacturerid manufacturer
0            0               6          Leo
1            1              12       Quibus
2            2               1        Abbas
3            3               2       Aliqui
4            4              14     Victoria
5            5               8       Natura
6            6               4       Currus
7            7               9        Palma
8            8              13       Salvus
9            9               5         Fama
10          10              11        Pomum
11          11              10        Pirum
12          12               3        Barba
13          13               7    VanArsdel

In [13]:
# eliminando a coluna de indice
df_fabricante = df_fabricante.drop(columns='Unnamed: 0').sort_values(by='manufacturerid', \
                                                                     ascending=True).reset_index(drop=True)
df_fabricante

    manufacturerid manufacturer
0                1        Abbas
1                2       Aliqui
2                3        Barba
3                4       Currus
4                5         Fama
5                6          Leo
6                7    VanArsdel
7                8       Natura
8                9        Palma
9               10        Pirum
10              11        Pomum
11              12       Quibus
12              13       Salvus
13              14     Victoria

In [14]:
#Definições da tabela
sql = 'CREATE TABLE fabricante ( manufacturerid  serial, manufacturer  varchar(10),  CONSTRAINT fabricante_Pkey PRIMARY KEY (manufacturerid));'
#Criação da tabela no banco
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [15]:
#exportação do banco em pandas para o banco de dados
tabela = 'fabricante'
col = {"manufacturerid": types.String(), "manufacturer": types.String() }
#engine = create_engine('postgresql://postgres:123@localhost:5432/dbpy')
engine = create_engine('postgresql://postgres:postgres@amarelo.cp6xfa6zogly.us-east-2.rds.amazonaws.com:5432/dbpy')
df_fabricante.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append')

In [16]:
#Verificando informações no banco
sql = 'SELECT * FROM fabricante;'
aws_postgres.selectSQL(sql)

[(1, 'Abbas'),
 (2, 'Aliqui'),
 (3, 'Barba'),
 (4, 'Currus'),
 (5, 'Fama'),
 (6, 'Leo'),
 (7, 'VanArsdel'),
 (8, 'Natura'),
 (9, 'Palma'),
 (10, 'Pirum'),
 (11, 'Pomum'),
 (12, 'Quibus'),
 (13, 'Salvus'),
 (14, 'Victoria')]

In [17]:
#importando arquivo GEO.CSV
df_geo = pd.read_csv('geo.csv',',')
df_geo

         zip              city state region      district
0      15201    Pittsburgh, PA    PA   East  District #13
1      15202    Pittsburgh, PA    PA   East  District #13
2      15203    Pittsburgh, PA    PA   East  District #13
3      15204    Pittsburgh, PA    PA   East  District #13
4      15205    Pittsburgh, PA    PA   East  District #13
...      ...               ...   ...    ...           ...
39943  59933       Stryker, MT    MT   West  District #33
39944  59934         Trego, MT    MT   West  District #33
39945  59935          Troy, MT    MT   West  District #33
39946  59936  West Glacier, MT    MT   West  District #33
39947  59937     Whitefish, MT    MT   West  District #33

[39948 rows x 5 columns]

In [18]:
#Ajuste da coluna city
df_geo['city'], df_geo['state'] = zip(*df_geo['city'].str.split(','))

In [19]:
df_geo['state'] = df_geo['state'].astype('str')
df_geo['state'] = df_geo['state'].str.strip()
df_geo

         zip          city state region      district
0      15201    Pittsburgh    PA   East  District #13
1      15202    Pittsburgh    PA   East  District #13
2      15203    Pittsburgh    PA   East  District #13
3      15204    Pittsburgh    PA   East  District #13
4      15205    Pittsburgh    PA   East  District #13
...      ...           ...   ...    ...           ...
39943  59933       Stryker    MT   West  District #33
39944  59934         Trego    MT   West  District #33
39945  59935          Troy    MT   West  District #33
39946  59936  West Glacier    MT   West  District #33
39947  59937     Whitefish    MT   West  District #33

[39948 rows x 5 columns]

In [20]:
#Definições da tabela
sql = 'CREATE TABLE geo ( id  serial, zip  varchar(5) UNIQUE, city  varchar(50), state  varchar(2), '\
'region  varchar(10), district  varchar(12),  CONSTRAINT geo_Pkey PRIMARY KEY (id));'
#Criação da tabela no banco
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [21]:
#exportação do banco em pandas para o banco de dados
tabela = 'geo'
col = { 'zip' :types.String(), 'city' : types.String(),'state' :types.String(), \
                     'region': types.String() , 'district': types.String()}
df_geo.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append',method='multi')

In [22]:
#verificando se a quantidade do arquivo CSV seria igual ao da tabela
sql = 'SELECT COUNT(*) FROM geo;'
aws_postgres.selectSQL(sql)

[(39948,)]

In [23]:
df_produto = pd.read_csv('produto.csv',',')
df_produto

,category,segment,product,productid,iscompetehide,manufacturerid
0,Urban,Convenience,Maximus UC-01,536,N,7
1,Urban,Convenience,Maximus UC-02,537,N,7
2,Urban,Convenience,Maximus UC-03,538,N,7
3,Urban,Convenience,Maximus UC-04,539,N,7
4,Urban,Convenience,Maximus UC-05,540,N,7
...,...,...,...,...,...,...
2407,Mix,Productivity,Quibus MP-28,1260,N,12
2408,Mix,Productivity,Quibus MP-29,1261,N,12
2409,Mix,Productivity,Quibus MP-30,1262,N,12
2410,Mix,Productivity,Quibus MP-31,1263,N,12
2411,Mix,Productivity,Quibus MP-32,1264,N,12

In [24]:
sql = 'CREATE TABLE produto ( id  SERIAL, category  VARCHAR(5),' \
       'segment  VARCHAR(20), product  VARCHAR(20), productid  BIGINT UNIQUE, iscompetehide  CHAR(1), '\
        'manufacturerid  BIGINT REFERENCES fabricante (manufacturerid), '\
        'CONSTRAINT produtos_Pkey PRIMARY KEY (id));'

In [25]:
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [26]:
#exportação do banco em pandas para o banco de dados
col = { 'category' :types.String(), 'segment' : types.String(),'product' :types.String(), \
                     'productid': types.Integer , 'iscompetehide': types.String(), 'manufacturerid': types.String()}
tabela = 'produto'
df_produto.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append',method='multi')

In [27]:
sql = 'SELECT COUNT(*) FROM produto;'
aws_postgres.selectSQL(sql)

[(2412,)]

In [28]:
df_vendas = pd.read_csv('vendas.csv',',')
df_vendas

         productid                    date    zip  units      revenue
0               88  15/02/2000 12:00:00 AM  95605     92  $926,780.40
1             2263  12/11/2008 12:00:00 AM  33178     44  $177,380.28
2             2262  12/11/2008 12:00:00 AM  33178     44  $177,380.28
3              764  27/07/2004 12:00:00 AM  27522     40  $146,134.80
4              763  27/07/2004 12:00:00 AM  27522     40  $146,134.80
...            ...                     ...    ...    ...          ...
1260747       2213  10/02/2006 12:00:00 AM  15135      1    $1,070.37
1260748       2213  03/06/2004 12:00:00 AM  80120      1    $1,070.37
1260749       2213  27/11/2003 12:00:00 AM  30028      1    $1,070.37
1260750       2213  30/09/2006 12:00:00 AM  65279      1    $1,070.37
1260751       2213  22/06/2005 12:00:00 AM  25526      1    $1,070.37

[1260752 rows x 5 columns]

In [29]:
#Ajuste da coluna data
df_vendas['date'] = pd.to_datetime(df_vendas['date'].str.slice(0,10,1),format = '%d/%m/%Y')
df_vendas

         productid       date    zip  units      revenue
0               88 2000-02-15  95605     92  $926,780.40
1             2263 2008-11-12  33178     44  $177,380.28
2             2262 2008-11-12  33178     44  $177,380.28
3              764 2004-07-27  27522     40  $146,134.80
4              763 2004-07-27  27522     40  $146,134.80
...            ...        ...    ...    ...          ...
1260747       2213 2006-02-10  15135      1    $1,070.37
1260748       2213 2004-06-03  80120      1    $1,070.37
1260749       2213 2003-11-27  30028      1    $1,070.37
1260750       2213 2006-09-30  65279      1    $1,070.37
1260751       2213 2005-06-22  25526      1    $1,070.37

[1260752 rows x 5 columns]

In [30]:
df_vendas['revenue'] = df_vendas['revenue'].str.replace('$','')
#limpando os caracteres especiais

In [31]:
#Ajustando para float
df_vendas['revenue'] = df_vendas['revenue'].str.replace(',','')
df_vendas

         productid       date    zip  units    revenue
0               88 2000-02-15  95605     92  926780.40
1             2263 2008-11-12  33178     44  177380.28
2             2262 2008-11-12  33178     44  177380.28
3              764 2004-07-27  27522     40  146134.80
4              763 2004-07-27  27522     40  146134.80
...            ...        ...    ...    ...        ...
1260747       2213 2006-02-10  15135      1    1070.37
1260748       2213 2004-06-03  80120      1    1070.37
1260749       2213 2003-11-27  30028      1    1070.37
1260750       2213 2006-09-30  65279      1    1070.37
1260751       2213 2005-06-22  25526      1    1070.37

[1260752 rows x 5 columns]

In [32]:
#coluna agora como float
df_vendas['revenue'] = df_vendas['revenue'].astype('float')
df_vendas['revenue']

0          926780.40
1          177380.28
2          177380.28
3          146134.80
4          146134.80
             ...
1260747      1070.37
1260748      1070.37
1260749      1070.37
1260750      1070.37
1260751      1070.37
Name: revenue, Length: 1260752, dtype: float64

In [33]:
sql = 'CREATE TABLE vendas ( id  SERIAL, productid  BIGINT REFERENCES produto (productid),' \
       'date  DATE, zip  VARCHAR(5) REFERENCES geo (zip), units  BIGINT, revenue  DECIMAL, '\
        'CONSTRAINT vendas_Pkey PRIMARY KEY (id));'

In [34]:
aws_postgres.run_query(sql)

Processo Executado com sucesso

In [37]:
#exportação do banco em pandas para o banco de dados
col = { 'productid' :types.Integer(), 'date' : types.Date(),'zip' :types.String(), \
                     'units': types.Integer , 'revenue': types.DECIMAL()}
tabela = 'vendas'
df_vendas.to_sql(name=tabela,con=engine,index=False,dtype=col,if_exists='append')

In [49]:
sql = 'SELECT COUNT(*) FROM vendas;'
aws_postgres.selectSQL(sql)

[(1260752,)]